app/controllers/grace_associates_controller.rb

  def index
    @grace_associates = GraceAssociate.all
---
SELECT "grace_associates".* FROM "grace_associates"

  def show
    @grace_associate = GraceAssociate.find(params[:id])
---
SELECT "grace_associates".* FROM "grace_associates" WHERE "grace_associates"."id" = $1 LIMIT 1  [["id", "1"]]

  def edit
    @grace_associate = GraceAssociate.find(params[:id])
---
SELECT "grace_associates".* FROM "grace_associates" WHERE "grace_associates"."id" = $1 LIMIT 1  [["id", "1"]]

  def create
    @grace_associate = GraceAssociate.new(params[:grace_associate])

    respond_to do |format|
      if @grace_associate.save
---
INSERT INTO "grace_associates" ("created_at", "email", "name", "password", "password_confirmation", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"